jest.mock('./fetch');

const {readFileSync} = require('fs');
const {resolve} = require('path');
const {getPageHTML} = require('./fetch');
const {parsePage} = require('.');

beforeAll(() => {
  const mockHtml = readFileSync(resolve(__dirname, './news-list.mock.html'));
  getPageHTML.mockReturnValue(mockHtml);
});

it('should export parsePage function', () => {
  expect(parsePage).toBeInstanceOf(Function);
});

it('should return list of 15 parsed news from page', async () => {
  const news = await parsePage(1);
  expect(news).toHaveLength(15);
});

it('should parse date and time properly', async () => {
  const news = await parsePage(1);
  expect(news[0]).toEqual({
    title: 'Зі святом весни, дорогі жінки!',
    description:
      'Весна – це завше час нових надій і сподівань, час, коли пробуджується природа, огортаючи все навкруги теплом і яскравими фарбами. Варто лише трохи зачекати і ясні сонячні промені будуть тішити нас й заряджати позитивним настроєм, додаючи життєвої енергії та бадьорості.',
    publishedAt: new Date('Tue Jul 03 2018 18:54:00 GMT+0300 (EEST)')
  });
});

it('should return news array in valid format', async () => {
  const news = await parsePage(1);
  expect(news).toEqual([
    {
      title: 'Зі святом весни, дорогі жінки!',
      description:
        'Весна – це завше час нових надій і сподівань, час, коли пробуджується природа, огортаючи все навкруги теплом і яскравими фарбами. Варто лише трохи зачекати і ясні сонячні промені будуть тішити нас й заряджати позитивним настроєм, додаючи життєвої енергії та бадьорості.',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'Запрошуємо молодих науковців, вчених, аспірантів, слухачів магістратури взяти участь у Ювілейній конференції Ради молодих вчених ТНЕУ!',
      description:
        'Ювілейна конференція Ради молодих вчених «Економічний і соціальний розвиток України в ХХІ столітті: національна візія та виклики глобалізації» відбудеться 29-30 березня 2018 року за адресою: м. Тернопіль, вул. Львівська, 11а (11 корпус університету).',
      publishedAt: expect.any(Date)
    },
    {
      title: 'Запрошуємо на арт-зустріч «НеФормат»!',
      description:
        'Закінчилися студентські канікули, тож арт-зустрічі «НеФормат» відкривають новий сезон. Відділ гуманітарної освіти та виховання чекає на творчу молодь університету 13 березня о 17.00 год. у виставковій залі ТНЕУ (центральний корпус).',
      publishedAt: expect.any(Date)
    },
    {
      title: 'До уваги студентів груп 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17!',
      description:
        'Повідомляємо, що 19-22 березня 2018 року відбудуться Збори академічної громади студентів груп 1, 2, 3, 4, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17 по обранню виборних представників із числа студентів для участі у виборах ректора ТНЕУ, що мають відбутися 25 квітня 2018 року.',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'Запрошуємо до участі у ІІ етапі Всеукраїнської студентської олімпіади зі спеціальності «Менеджмент організацій і адміністрування»',
      description:
        'На виконання наказу Міністерства освіти і науки України № 1572 від 06.12.2017 р. «Про проведення Всеукраїнської студентської олімпіади у 2017/2018 навчальному році» на базі Тернопільського національного економічного університету 25-27 квітня 2018 р. відбудеться II етап Всеукраїнської студентської олімпіади зі спеціальності «Менеджмент організацій і адміністрування» (за видами економічної діяльності).',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'До уваги штатних працівників, які не є науковими, науково-педагогічними та педагогічними працівниками, груп 1, 2, 4, 5!',
      description:
        'Повідомляємо, що 19-20 березня 2018 року відбудуться Загальні збори трудового колективу штатних працівників, які не є науковими, науково-педагогічними та педагогічними працівниками, груп 1, 2, 4, 5 по обранню виборних представників із числа штатних працівників ТНЕУ, які не є науковими, науково-педагогічними і педагогічними працівниками, для участі у виборах ректора ТНЕУ, що мають відбутися 25 квітня 2018 року.',
      publishedAt: expect.any(Date)
    },
    {
      title: 'До уваги студентів!',
      description:
        'Центр підготовки офіцерів запасу розпочинає набір на навчання на військовій кафедрі Національної академії сухопутних військ. Студентів, котрі виявили бажання проходити військову підготовку на військовій кафедрі, просимо ознайомитися з правилами конкурсного відбору, переліком необхідних документів, а також термінами їх подачі на сайті ТНЕУ ЦПОЗ або за адресою: Микулинецька 46а, каб. 604.',
      publishedAt: expect.any(Date)
    },
    {
      title:
        '«Конкурентоспроможність вітчизняних підприємств-надавачів послуг громадського транспорту: актуальні проблеми та європейський досвід їх вирішення»',
      description:
        'Колектив кафедри підприємництва, торгівлі та маркетингу ТНЕУ запрошує усіх бажаючих до участі у роботі І Всеукраїнської науково-практичної конференції студентів, аспірантів та молодих вчених «Конкурентоспроможність вітчизняних підприємств-надавачів послуг громадського транспорту: актуальні проблеми та європейський досвід їх вирішення», яка відбудеться 19-20 квітня 2018 р. у Тернопільському національному економічному університеті.',
      publishedAt: expect.any(Date)
    },
    {
      title: '7 березня',
      description:
        'Найнеприємніший факт стосовно Всесвіту полягає не в тому, що він налаштований вороже, а в тому що йому байдуже (Стенлі Кубрик)',
      publishedAt: expect.any(Date)
    },
    {
      title: '«Облік, оподаткування і контроль: сучасний стан та напрями розвитку»',
      description:
        'Шановні колеги! Запрошуємо Вас взяти участь у Всеукраїнській науково-практичній інтернет-конференції «Облік, оподаткування і контроль: сучасний стан та напрями розвитку», яка відбудеться 22 березня 2018 р. у Черкаському інституті ДВНЗ «Університет банківської справи».',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'Відбулася 14 Міжнародна конференція «Advanced Trends in Radioelectronics, Telecommunications and Computer Engineering (TCSET’2018)»',
      description:
        'Упродовж 20-24 лютого 2018 р. в смт Славське Львівської області відбулася 14 Міжнародна конференція «Advanced Trends in Radioelectronics, Telecommunications and Computer Engineering (TCSET)». Головна мета конференції – представлення нових результатів досліджень, нових тенденцій у науці і техніці, обмін науковими ідеями.',
      publishedAt: expect.any(Date)
    },
    {
      title: 'Відбулося засідання організаційного комітету з проведення виборів ректора ТНЕУ',
      description:
        'Шостого березня 2018 р. відбулося чергове засідання організаційного комітету з проведення виборів ректора Тернопільського національного економічного університету.',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'У Республіці Польща відкрито Міжнародний центр освіти та розвитку ТНЕУ й Інституту європейської інтеграції',
      description:
        'Шостого березня 2018 р. Тернопільським національним економічним університетом спільно з Інститутом європейської інтеграції у Варшаві під патронатом Посольства України в Польщі та Тернопільської обласної державної адміністрації було створено Міжнародний центр освіти та розвитку.',
      publishedAt: expect.any(Date)
    },
    {
      title:
        'До уваги студентів груп 5, 20, 21 та штатних працівників, які не є науковими, науково-педагогічними і педагогічними працівниками, групи 3!',
      description:
        'Повідомляємо, що 16 березня 2018 року відбудуться Збори академічної громади студентів груп 5, 20, 21 та Загальні збори трудового колективу крупи 3 по обранню виборних представників із числа студентів та штатних працівників, які не є науковими, науково-педагогічними і педагогічними працівниками, для участі у виборах ректора Тернопільського національного економічного університету, що відбудуться 25 квітня 2018 року.',
      publishedAt: expect.any(Date)
    },
    {
      title: 'Вітаємо!',
      description:
        'Упродовж 2-4 березня у м. Луцьк проходив Кубок України з боротьби самбо. Щиро вітаємо студентку факультету фінансів (група ФМСм-11) ТНЕУ Акопян Алвард, яка здобула срібну нагороду у ваговій категорії 52 кг.',
      publishedAt: expect.any(Date)
    }
  ]);
});
